/*

  공부는 
  vscode 또는 dartpad를 사용하여 진행한다.

  다트는 파일 내에 같은 이름의 클래스가 없어도 작동한다.

  다트의 특징
  - 모든 것이 객체이다. (function, number, string, boolean, list, map, set, null, etc.)
  - 모든 타입이 1급 객체이다.
  - 다트는 자바스크립트와 비슷한 문법을 가지고 있다.
  - 다트는 자바스크립트와 달리 타입을 명시할 수 있다.
  - Dart는 "async"를 사용하여 비동기 프로그래밍을 기본적으로 지원.
  - Dart는 "Isolate"를 사용하여 멀티코어 프로그래밍을 지원.
  - Dart는 JavaScript로 컴파일될 수 있으므로 플러그인이나 기타 도구 없이 최신 웹 브라우저에서 실행 (아직 비인기)
  - Dart는 "Flutter"를 사용하여 모바일 앱을 개발할 수 있다.

  1급 객체
  - 1 급 객체란 변수나 데이터 구조 안에 담을 수 있고, 
    파라미터로 전달하거나 반환값으로 사용할 수 있는 객체를 말한다.

 */